Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/default/python-tornado/target_count_13/repeat_26/4.txt
2020/01/23 01:35:44 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8004/
2020/01/23 01:36:14 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 22333 requests
Server Software:        TornadoServer/4.5.3
Server Hostname:        192.168.3.100
Server Port:            8004
Document Path:          /
Document Length:        1000 bytes
Concurrency Level:      100
Time taken for tests:   30.008 seconds
Complete requests:      22333
Failed requests:        0
Total transferred:      26732601 bytes
HTML transferred:       22333000 bytes
Requests per second:    744.24 [#/sec] (mean)
Time per request:       134.366 [ms] (mean)
Time per request:       1.344 [ms] (mean, across all concurrent requests)
Transfer rate:          869.97 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0      11
Processing:     4  134  62.5    141     617
Waiting:        4  134  62.4    141     617
Total:          7  134  62.5    141     618
Percentage of the requests served within a certain time (ms)
  50%    141
  66%    154
  75%    163
  80%    168
  90%    188
  95%    220
  98%    302
  99%    366
 100%    618 (longest request)
2020/01/23 01:36:14 Matched stat line [Connect:        0    0   0.2      0      11 Connect 0 0 0.2 0 11]
2020/01/23 01:36:14 Matched stat line [Processing:     4  134  62.5    141     617 Processing 4 134 62.5 141 617]
2020/01/23 01:36:14 Matched stat line [Waiting:        4  134  62.4    141     617 Waiting 4 134 62.4 141 617]
2020/01/23 01:36:14 Matched stat line [Total:          7  134  62.5    141     618 Total 7 134 62.5 141 618]
2020/01/23 01:36:14 Matched percentline [  50%    141 50 141]
2020/01/23 01:36:14 Matched percentline [  66%    154 66 154]
2020/01/23 01:36:14 Matched percentline [  75%    163 75 163]
2020/01/23 01:36:14 Matched percentline [  80%    168 80 168]
2020/01/23 01:36:14 Matched percentline [  90%    188 90 188]
2020/01/23 01:36:14 Matched percentline [  95%    220 95 220]
2020/01/23 01:36:14 Matched percentline [  98%    302 98 302]
2020/01/23 01:36:14 Matched percentline [  99%    366 99 366]
2020/01/23 01:36:14 Matched percentline [ 100%    618 100 618]
{"connect":{"max":11,"mean":0,"median":0,"min":0,"stdDev":0.20000000298023224},"percentiles":{"100":618,"50":141,"66":154,"75":163,"80":168,"90":188,"95":220,"98":302,"99":366},"processing":{"max":617,"mean":134,"median":141,"min":4,"stdDev":62.5},"total":{"max":618,"mean":134,"median":141,"min":7,"stdDev":62.5},"waiting":{"max":617,"mean":134,"median":141,"min":4,"stdDev":62.400001525878906}}